MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334FAUI/mcu.h
/**
 *******************************************************************************
 ** \brief Event number enumeration
 ******************************************************************************/
typedef enum {
    EVT_SRC_SWI_IRQ0             = 0U,
    EVT_SRC_SWI_IRQ1             = 1U,
    EVT_SRC_SWI_IRQ2             = 2U,
    EVT_SRC_SWI_IRQ3             = 3U,
    EVT_SRC_SWI_IRQ4             = 4U,
    EVT_SRC_SWI_IRQ5             = 5U,
    EVT_SRC_SWI_IRQ6             = 6U,
    EVT_SRC_SWI_IRQ7             = 7U,
    EVT_SRC_SWI_IRQ8             = 8U,
    EVT_SRC_SWI_IRQ9             = 9U,
    EVT_SRC_SWI_IRQ10            = 10U,
    EVT_SRC_SWI_IRQ11            = 11U,
    EVT_SRC_SWI_IRQ12            = 12U,
    EVT_SRC_SWI_IRQ13            = 13U,
    EVT_SRC_SWI_IRQ14            = 14U,
    EVT_SRC_SWI_IRQ15            = 15U,
    EVT_SRC_SWI_IRQ16            = 16U,
    EVT_SRC_SWI_IRQ17            = 17U,
    EVT_SRC_SWI_IRQ18            = 18U,
    EVT_SRC_SWI_IRQ19            = 19U,
    EVT_SRC_SWI_IRQ20            = 20U,
    EVT_SRC_SWI_IRQ21            = 21U,
    EVT_SRC_SWI_IRQ22            = 22U,
    EVT_SRC_SWI_IRQ23            = 23U,
    EVT_SRC_SWI_IRQ24            = 24U,
    EVT_SRC_SWI_IRQ25            = 25U,
    EVT_SRC_SWI_IRQ26            = 26U,
    EVT_SRC_SWI_IRQ27            = 27U,
    EVT_SRC_SWI_IRQ28            = 28U,
    EVT_SRC_SWI_IRQ29            = 29U,
    EVT_SRC_SWI_IRQ30            = 30U,
    EVT_SRC_SWI_IRQ31            = 31U,
    /*  External Interrupt   */
    EVT_SRC_PORT_EIRQ0           = 0U,      /* EIRQ0  */
    EVT_SRC_PORT_EIRQ1           = 1U,      /* EIRQ1  */
    EVT_SRC_PORT_EIRQ2           = 2U,      /* EIRQ2  */
    EVT_SRC_PORT_EIRQ3           = 3U,      /* EIRQ3  */
    EVT_SRC_PORT_EIRQ4           = 4U,      /* EIRQ4  */
    EVT_SRC_PORT_EIRQ5           = 5U,      /* EIRQ5  */
    EVT_SRC_PORT_EIRQ6           = 6U,      /* EIRQ6  */
    EVT_SRC_PORT_EIRQ7           = 7U,      /* EIRQ7  */
    EVT_SRC_PORT_EIRQ8           = 8U,      /* EIRQ8  */
    EVT_SRC_PORT_EIRQ9           = 9U,      /* EIRQ9  */
    EVT_SRC_PORT_EIRQ10          = 10U,     /* EIRQ10 */
    EVT_SRC_PORT_EIRQ11          = 11U,     /* EIRQ11 */
    EVT_SRC_PORT_EIRQ12          = 12U,     /* EIRQ12 */
    EVT_SRC_PORT_EIRQ13          = 13U,     /* EIRQ13 */
    EVT_SRC_PORT_EIRQ14          = 14U,     /* EIRQ14 */
    EVT_SRC_PORT_EIRQ15          = 15U,     /* EIRQ15 */
    /*  DMA  */
    EVT_SRC_DMA_TC0              = 33U,     /* DMA_TC0  */
    EVT_SRC_DMA_BTC0             = 34U,     /* DMA_BTC0 */
    EVT_SRC_DMA_TC1              = 35U,     /* DMA_TC1  */
    EVT_SRC_DMA_BTC1             = 36U,     /* DMA_BTC1 */
    EVT_SRC_DMA_TC2              = 37U,     /* DMA_TC2  */
    EVT_SRC_DMA_BTC2             = 38U,     /* DMA_BTC2 */
    EVT_SRC_DMA_TC3              = 39U,     /* DMA_TC3  */
    EVT_SRC_DMA_BTC3             = 40U,     /* DMA_BTC3 */
    EVT_SRC_DMA_TC4              = 41U,     /* DMA_TC4  */
    EVT_SRC_DMA_BTC4             = 42U,     /* DMA_BTC4 */
    EVT_SRC_DMA_TC5              = 43U,     /* DMA_TC5  */
    EVT_SRC_DMA_BTC5             = 44U,     /* DMA_BTC5 */
    EVT_SRC_DMA_TC6              = 45U,     /* DMA_TC6  */
    EVT_SRC_DMA_BTC6             = 46U,     /* DMA_BTC6 */
    EVT_SRC_DMA_TC7              = 47U,     /* DMA_TC7  */
    EVT_SRC_DMA_BTC7             = 48U,     /* DMA_BTC7 */
    /*  EFM  */
    EVT_SRC_EFM_OPTEND           = 51U,     /* EFM_OPTEND */
    /*  TIMER0  */
    EVT_SRC_TMR0_1_CMP_A         = 96U,     /* TMR0_1_CMPA */
    EVT_SRC_TMR0_1_CMP_B         = 97U,     /* TMR0_1_CMPB */
    EVT_SRC_TMR0_1_OVF_A         = 98U,     /* TMR0_1_OVFA */
    EVT_SRC_TMR0_1_OVF_B         = 99U,     /* TMR0_1_OVFB */
    EVT_SRC_TMR0_2_CMP_A         = 100U,    /* TMR0_2_CMPA */
    EVT_SRC_TMR0_2_CMP_B         = 101U,    /* TMR0_2_CMPB */
    EVT_SRC_TMR0_2_OVF_A         = 102U,    /* TMR0_2_OVFA */
    EVT_SRC_TMR0_2_OVF_B         = 103U,    /* TMR2_2_OVFB */
    /*  RTC  */
    EVT_SRC_RTC_ALM              = 121U,     /* RTC_ALM */
    EVT_SRC_RTC_PRD              = 122U,     /* RTC_PRD */
    /*  TIMER6_1  */
    EVT_SRC_TMR6_1_GCMP_A        = 128U,     /* TMR6_1_GCMA */
    EVT_SRC_TMR6_1_GCMP_B        = 129U,     /* TMR6_1_GCMB */
    EVT_SRC_TMR6_1_GCMP_C        = 130U,     /* TMR6_1_GCMC */
    EVT_SRC_TMR6_1_GCMP_D        = 131U,     /* TMR6_1_GCMD */
    EVT_SRC_TMR6_1_GCMP_E        = 132U,     /* TMR6_1_GCME */
    EVT_SRC_TMR6_1_GCMP_F        = 133U,     /* TMR6_1_GCMF */
    EVT_SRC_TMR6_1_OVF           = 134U,     /* TMR6_1_GOVF */
    EVT_SRC_TMR6_1_UDF           = 135U,     /* TMR6_1_GUDF */
    EVT_SRC_TMR6_1_SCMP_A        = 137U,     /* TMR6_1_SCMA */
    EVT_SRC_TMR6_1_SCMP_B        = 138U,     /* TMR6_1_SCMB */
    /*  TIMERA_1  */
    EVT_SRC_TMRA_1_OVF           = 139U,     /* TMRA_1_OVF */
    EVT_SRC_TMRA_1_UDF           = 140U,     /* TMRA_1_UDF */
    EVT_SRC_TMRA_1_CMP           = 141U,     /* TMRA_1_CMP */
    /*  TIMER6_2  */
    EVT_SRC_TMR6_2_GCMP_A        = 144U,     /* TMR6_2_GCMA */
    EVT_SRC_TMR6_2_GCMP_B        = 145U,     /* TMR6_2_GCMB */
    EVT_SRC_TMR6_2_GCMP_C        = 146U,     /* TMR6_2_GCMC */
    EVT_SRC_TMR6_2_GCMP_D        = 147U,     /* TMR6_2_GCMD */
    EVT_SRC_TMR6_2_GCMP_E        = 148U,     /* TMR6_2_GCME */
    EVT_SRC_TMR6_2_GCMP_F        = 149U,     /* TMR6_2_GCMF */
    EVT_SRC_TMR6_2_OVF           = 150U,     /* TMR6_2_GOVF */
    EVT_SRC_TMR6_2_UDF           = 151U,     /* TMR6_2_GUDF */
    EVT_SRC_TMR6_2_SCMP_A        = 153U,     /* TMR6_2_SCMA */
    EVT_SRC_TMR6_2_SCMP_B        = 154U,     /* TMR6_2_SCMB */
    /*  TIMERA_2  */
    EVT_SRC_TMRA_2_OVF           = 155U,     /* TMRA_2_OVF */
    EVT_SRC_TMRA_2_UDF           = 156U,     /* TMRA_2_UDF */
    EVT_SRC_TMRA_2_CMP           = 157U,     /* TMRA_2_CMP */
    /*  TIMER6_3  */
    EVT_SRC_TMR6_3_GCMP_A        = 160U,     /* TMR6_3_GCMA */
    EVT_SRC_TMR6_3_GCMP_B        = 161U,     /* TMR6_3_GCMB */
    EVT_SRC_TMR6_3_GCMP_C        = 162U,     /* TMR6_3_GCMC */
    EVT_SRC_TMR6_3_GCMP_D        = 163U,     /* TMR6_3_GCMD */
    EVT_SRC_TMR6_3_GCMP_E        = 164U,     /* TMR6_3_GCME */
    EVT_SRC_TMR6_3_GCMP_F        = 165U,     /* TMR6_3_GCMF */
    EVT_SRC_TMR6_3_OVF           = 166U,     /* TMR6_3_GOVF */
    EVT_SRC_TMR6_3_UDF           = 167U,     /* TMR6_3_GUDF */
    EVT_SRC_TMR6_3_SCMP_A        = 169U,     /* TMR6_3_SCMA */
    EVT_SRC_TMR6_3_SCMP_B        = 170U,     /* TMR6_3_SCMB */
    /*  TIMERA_3  */
    EVT_SRC_TMRA_3_OVF           = 171U,     /* TMRA_3_OVF */
    EVT_SRC_TMRA_3_UDF           = 172U,     /* TMRA_3_UDF */
    EVT_SRC_TMRA_3_CMP           = 173U,     /* TMRA_3_CMP */
    /*  TIMER6_4 */
    EVT_SRC_TMR6_4_GCMP_A        = 176U,     /* TMR6_4_GCMA */
    EVT_SRC_TMR6_4_GCMP_B        = 177U,     /* TMR6_4_GCMB */
    EVT_SRC_TMR6_4_GCMP_C        = 178U,     /* TMR6_4_GCMC */
    EVT_SRC_TMR6_4_GCMP_D        = 179U,     /* TMR6_4_GCMD */
    EVT_SRC_TMR6_4_GCMP_E        = 180U,     /* TMR6_4_GCME */
    EVT_SRC_TMR6_4_GCMP_F        = 181U,     /* TMR6_4_GCMF */
    EVT_SRC_TMR6_4_OVF           = 182U,     /* TMR6_4_GOVF */
    EVT_SRC_TMR6_4_UDF           = 183U,     /* TMR6_4_GUDF */
    EVT_SRC_TMR6_4_SCMP_A        = 185U,     /* TMR6_4_SCMA */
    EVT_SRC_TMR6_4_SCMP_B        = 186U,     /* TMR6_4_SCMB */
    /*  TIMERA_4  */
    EVT_SRC_TMRA_4_OVF           = 187U,     /* TMRA_4_OVF */
    EVT_SRC_TMRA_4_UDF           = 188U,     /* TMRA_4_UDF */
    EVT_SRC_TMRA_4_CMP           = 189U,     /* TMRA_4_CMP */
    /*  HRPWM_1 */
    EVT_SRC_HRPWM_1_GCMP_A       = 192U,     /* HRPWM_1_GCMA */
    EVT_SRC_HRPWM_1_GCMP_B       = 193U,     /* HRPWM_1_GCMB */
    EVT_SRC_HRPWM_1_GCMP_C       = 194U,     /* HRPWM_1_GCMC */
    EVT_SRC_HRPWM_1_GCMP_D       = 195U,     /* HRPWM_1_GCMD */
    EVT_SRC_HRPWM_1_GCMP_E       = 196U,     /* HRPWM_1_GCME */
    EVT_SRC_HRPWM_1_GCMP_F       = 197U,     /* HRPWM_1_GCMF */
    EVT_SRC_HRPWM_1_OVF          = 198U,     /* HRPWM_1_GOVF */
    EVT_SRC_HRPWM_1_UDF          = 199U,     /* HRPWM_1_GUDF */
    EVT_SRC_HRPWM_1_SCMP_A       = 200U,     /* HRPWM_1_SCMA */
    EVT_SRC_HRPWM_1_SCMP_B       = 201U,     /* HRPWM_1_SCMB */
    EVT_SRC_HRPWM_1_GCAP_A       = 202U,     /* HRPWM_1_GCAPA */
    EVT_SRC_HRPWM_1_GCAP_B       = 203U,     /* HRPWM_1_GCAPB */
    /*  HRPWM_2 */
    EVT_SRC_HRPWM_2_GCMP_A       = 204U,     /* HRPWM_2_GCMA */
    EVT_SRC_HRPWM_2_GCMP_B       = 205U,     /* HRPWM_2_GCMB */
    EVT_SRC_HRPWM_2_GCMP_C       = 206U,     /* HRPWM_2_GCMC */
    EVT_SRC_HRPWM_2_GCMP_D       = 207U,     /* HRPWM_2_GCMD */
    EVT_SRC_HRPWM_2_GCMP_E       = 208U,     /* HRPWM_2_GCME */
    EVT_SRC_HRPWM_2_GCMP_F       = 209U,     /* HRPWM_2_GCMF */
    EVT_SRC_HRPWM_2_OVF          = 210U,     /* HRPWM_2_GOVF */
    EVT_SRC_HRPWM_2_UDF          = 211U,     /* HRPWM_2_GUDF */
    EVT_SRC_HRPWM_2_SCMP_A       = 212U,     /* HRPWM_2_SCMA */
    EVT_SRC_HRPWM_2_SCMP_B       = 213U,     /* HRPWM_2_SCMB */
    EVT_SRC_HRPWM_2_GCAP_A       = 214U,     /* HRPWM_2_GCAPA */
    EVT_SRC_HRPWM_2_GCAP_B       = 215U,     /* HRPWM_2_GCAPB */
    /*  HRPWM EEDET  */
    EVT_SRC_HRPWM_EEDET          = 219U,     /* HRPWM_EEDET */
    /*  HRPWM_3 */
    EVT_SRC_HRPWM_3_GCMP_A       = 224U,     /* HRPWM_3_GCMA */
    EVT_SRC_HRPWM_3_GCMP_B       = 225U,     /* HRPWM_3_GCMB */
    EVT_SRC_HRPWM_3_GCMP_C       = 226U,     /* HRPWM_3_GCMC */
    EVT_SRC_HRPWM_3_GCMP_D       = 227U,     /* HRPWM_3_GCMD */
    EVT_SRC_HRPWM_3_GCMP_E       = 228U,     /* HRPWM_3_GCME */
    EVT_SRC_HRPWM_3_GCMP_F       = 229U,     /* HRPWM_3_GCMF */
    EVT_SRC_HRPWM_3_OVF          = 230U,     /* HRPWM_3_GOVF */
    EVT_SRC_HRPWM_3_UDF          = 231U,     /* HRPWM_3_GUDF */
    EVT_SRC_HRPWM_3_SCMP_A       = 232U,     /* HRPWM_3_SCMA */
    EVT_SRC_HRPWM_3_SCMP_B       = 233U,     /* HRPWM_3_SCMB */
    EVT_SRC_HRPWM_3_GCAP_A       = 234U,     /* HRPWM_3_GCAPA */
    EVT_SRC_HRPWM_3_GCAP_B       = 235U,     /* HRPWM_3_GCAPB */
    /*  HRPWM_4 */
    EVT_SRC_HRPWM_4_GCMP_A       = 236U,     /* HRPWM_4_GCMA */
    EVT_SRC_HRPWM_4_GCMP_B       = 237U,     /* HRPWM_4_GCMB */
    EVT_SRC_HRPWM_4_GCMP_C       = 238U,     /* HRPWM_4_GCMC */
    EVT_SRC_HRPWM_4_GCMP_D       = 239U,     /* HRPWM_4_GCMD */
    EVT_SRC_HRPWM_4_GCMP_E       = 240U,     /* HRPWM_4_GCME */
    EVT_SRC_HRPWM_4_GCMP_F       = 241U,     /* HRPWM_4_GCMF */
    EVT_SRC_HRPWM_4_OVF          = 242U,     /* HRPWM_4_GOVF */
    EVT_SRC_HRPWM_4_UDF          = 243U,     /* HRPWM_4_GUDF */
    EVT_SRC_HRPWM_4_SCMP_A       = 244U,     /* HRPWM_4_SCMA */
    EVT_SRC_HRPWM_4_SCMP_B       = 245U,     /* HRPWM_4_SCMB */
    EVT_SRC_HRPWM_4_GCAP_A       = 246U,     /* HRPWM_4_GCAPA */
    EVT_SRC_HRPWM_4_GCAP_B       = 247U,     /* HRPWM_4_GCAPB */
    /*  HRPWM_5 */
    EVT_SRC_HRPWM_5_GCMP_A       = 256U,     /* HRPWM_5_GCMA */
    EVT_SRC_HRPWM_5_GCMP_B       = 257U,     /* HRPWM_5_GCMB */
    EVT_SRC_HRPWM_5_GCMP_C       = 258U,     /* HRPWM_5_GCMC */
    EVT_SRC_HRPWM_5_GCMP_D       = 259U,     /* HRPWM_5_GCMD */
    EVT_SRC_HRPWM_5_GCMP_E       = 260U,     /* HRPWM_5_GCME */
    EVT_SRC_HRPWM_5_GCMP_F       = 261U,     /* HRPWM_5_GCMF */
    EVT_SRC_HRPWM_5_OVF          = 262U,     /* HRPWM_5_GOVF */
    EVT_SRC_HRPWM_5_UDF          = 263U,     /* HRPWM_5_GUDF */
    EVT_SRC_HRPWM_5_SCMP_A       = 264U,     /* HRPWM_5_SCMA */
    EVT_SRC_HRPWM_5_SCMP_B       = 265U,     /* HRPWM_5_SCMB */
    EVT_SRC_HRPWM_5_GCAP_A       = 266U,     /* HRPWM_5_GCAPA */
    EVT_SRC_HRPWM_5_GCAP_B       = 267U,     /* HRPWM_5_GCAPB */
    /*  HRPWM_6 */
    EVT_SRC_HRPWM_6_GCMP_A       = 268U,     /* HRPWM_6_GCMA */
    EVT_SRC_HRPWM_6_GCMP_B       = 269U,     /* HRPWM_6_GCMB */
    EVT_SRC_HRPWM_6_GCMP_C       = 270U,     /* HRPWM_6_GCMC */
    EVT_SRC_HRPWM_6_GCMP_D       = 271U,     /* HRPWM_6_GCMD */
    EVT_SRC_HRPWM_6_GCMP_E       = 272U,     /* HRPWM_6_GCME */
    EVT_SRC_HRPWM_6_GCMP_F       = 273U,     /* HRPWM_6_GCMF */
    EVT_SRC_HRPWM_6_OVF          = 274U,     /* HRPWM_6_GOVF */
    EVT_SRC_HRPWM_6_UDF          = 275U,     /* HRPWM_6_GUDF */
    EVT_SRC_HRPWM_6_SCMP_A       = 276U,     /* HRPWM_6_SCMA */
    EVT_SRC_HRPWM_6_SCMP_B       = 277U,     /* HRPWM_6_SCMB */
    EVT_SRC_HRPWM_6_GCAP_A       = 278U,     /* HRPWM_6_GCAPA */
    EVT_SRC_HRPWM_6_GCAP_B       = 279U,     /* HRPWM_6_GCAPB */
    /*  TIMER4  */
    EVT_SRC_TMR4_GCMP_UH         = 288U,     /* TMR4_GCMUH */
    EVT_SRC_TMR4_GCMP_UL         = 289U,     /* TMR4_GCMUL */
    EVT_SRC_TMR4_GCMP_VH         = 290U,     /* TMR4_GCMVH */
    EVT_SRC_TMR4_GCMP_VL         = 291U,     /* TMR4_GCMVL */
    EVT_SRC_TMR4_GCMP_WH         = 292U,     /* TMR4_GCMWH */
    EVT_SRC_TMR4_GCMP_WL         = 293U,     /* TMR4_GCMWL */
    EVT_SRC_TMR4_GCMP_XH         = 294U,     /* TMR4_GCMXH */
    EVT_SRC_TMR4_GCMP_XL         = 295U,     /* TMR4_GCMXL */
    EVT_SRC_TMR4_OVF             = 296U,     /* TMR4_GOVF  */
    EVT_SRC_TMR4_UDF             = 297U,     /* TMR4_GUDF  */
    EVT_SRC_TMR4_RELOAD_U        = 298U,     /* TMR4_GRLU  */
    EVT_SRC_TMR4_RELOAD_V        = 299U,     /* TMR4_GRLV  */
    EVT_SRC_TMR4_RELOAD_W        = 300U,     /* TMR4_GRLW  */
    EVT_SRC_TMR4_RELOAD_X        = 301U,     /* TMR4_GRLX  */
    EVT_SRC_TMR4_SCMP0           = 302U,     /* TMR4_SCM0 */
    EVT_SRC_TMR4_SCMP1           = 303U,     /* TMR4_SCM1 */
    EVT_SRC_TMR4_SCMP2           = 304U,     /* TMR4_SCM2 */
    EVT_SRC_TMR4_SCMP3           = 305U,     /* TMR4_SCM3 */
    EVT_SRC_TMR4_SCMP4           = 306U,     /* TMR4_SCM4 */
    EVT_SRC_TMR4_SCMP5           = 307U,     /* TMR4_SCM5 */
    EVT_SRC_TMR4_SCMP6           = 308U,     /* TMR4_SCM6 */
    EVT_SRC_TMR4_SCMP7           = 309U,     /* TMR4_SCM7 */
    /*  CMP  */
    EVT_SRC_CMP1                 = 310U,     /* CMP_1_IRQ */
    EVT_SRC_CMP2                 = 311U,     /* CMP_2_IRQ */
    EVT_SRC_CMP3                 = 312U,     /* CMP_3_IRQ */
    /*  I2C  */
    EVT_SRC_I2C_RXI              = 316U,     /* I2C_RXI */
    EVT_SRC_I2C_TXI              = 317U,     /* I2C_TXI */
    EVT_SRC_I2C_TEI              = 318U,     /* I2C_TEI */
    EVT_SRC_I2C_EEI              = 319U,     /* I2C_EEI */
    /*  USART1  */
    EVT_SRC_USART1_EI            = 321U,     /* USART_1_EI  */
    EVT_SRC_USART1_RI            = 322U,     /* USART_1_RI  */
    EVT_SRC_USART1_TI            = 323U,     /* USART_1_TI  */
    EVT_SRC_USART1_RTO           = 324U,     /* USART_1_RTO */
    EVT_SRC_USART1_TENDI         = 325U,     /* USART_1_TENDI */
    EVT_SRC_USART1_TCI           = 326U,     /* USART_1_TCI */
    /*  SPI  */
    EVT_SRC_SPI_SPRI             = 330U,     /* SPI_SPRI */
    EVT_SRC_SPI_SPTI             = 331U,     /* SPI_SPTI */
    EVT_SRC_SPI_SPII             = 332U,     /* SPI_SPII */
    EVT_SRC_SPI_SPEI             = 333U,     /* SPI_SPEI */
    EVT_SRC_SPI_SPTEND           = 333U,     /* SPI_SPTEND */
    /*  TIMERA_5  */
    EVT_SRC_TMRA_5_OVF           = 340U,     /* TMRA_5_OVF */
    EVT_SRC_TMRA_5_UDF           = 341U,     /* TMRA_5_UDF */
    EVT_SRC_TMRA_5_CMP           = 342U,     /* TMRA_5_CMP */
    /*  EVENT PORT  */
    EVT_SRC_EVENT_PORT1          = 348U,     /* EVENT_PORT1 */
    EVT_SRC_EVENT_PORT2          = 349U,     /* EVENT_PORT2 */
    EVT_SRC_EVENT_PORT3          = 350U,     /* EVENT_PORT3 */
    EVT_SRC_EVENT_PORT4          = 351U,     /* EVENT_PORT4 */
    /*  USART2  */
    EVT_SRC_USART2_BRKWKPI       = 352U,     /* USART_2_BRKWKPI */
    EVT_SRC_USART2_EI            = 353U,     /* USART_2_EI      */
    EVT_SRC_USART2_RI            = 354U,     /* USART_2_RI      */
    EVT_SRC_USART2_TI            = 355U,     /* USART_2_TI      */
    EVT_SRC_USART2_RTO           = 356U,     /* USART_2_RTO     */
    EVT_SRC_USART2_TENDI         = 357U,     /* USART_2_TENDI   */
    EVT_SRC_USART2_TCI           = 358U,     /* USART_2_TCI     */
    /*  USART3  */
    EVT_SRC_USART3_BRKWKPI       = 384U,     /* USART_3_BRKWKPI */
    EVT_SRC_USART3_EI            = 385U,     /* USART_3_EI      */
    EVT_SRC_USART3_RI            = 386U,     /* USART_3_RI      */
    EVT_SRC_USART3_TI            = 387U,     /* USART_3_TI      */
    EVT_SRC_USART3_RTO           = 388U,     /* USART_3_RTO     */
    EVT_SRC_USART3_TENDI         = 389U,     /* USART_3_TENDI   */
    EVT_SRC_USART3_TCI           = 390U,     /* USART_3_TCI     */
    /*  USART4  */
    EVT_SRC_USART4_BRKWKPI       = 391U,     /* USART_4_BRKWKPI */
    EVT_SRC_USART4_EI            = 392U,     /* USART_4_EI      */
    EVT_SRC_USART4_RI            = 393U,     /* USART_4_RI      */
    EVT_SRC_USART4_TI            = 394U,     /* USART_4_TI      */
    EVT_SRC_USART4_RTO           = 395U,     /* USART_4_RTO     */
    EVT_SRC_USART4_TENDI         = 396U,     /* USART_4_TENDI   */
    EVT_SRC_USART4_TCI           = 397U,     /* USART_4_TCI     */
    /*  AOS  */
    EVT_SRC_AOS_STRG             = 415U,     /* AOS_STRG */
    /*  PLA  */
    EVT_SRC_PLA_ADTRG0           = 432U,     /* PLA_ADTRG0  */
    EVT_SRC_PLA_ADTRG1           = 433U,     /* PLA_ADTRG1  */
    EVT_SRC_PLA_ADTRG2           = 434U,     /* PLA_ADTRG2  */
    EVT_SRC_PLA_ADTRG3           = 435U,     /* PLA_ADTRG3  */
    EVT_SRC_PLA_ADTRG4           = 436U,     /* PLA_ADTRG4  */
    EVT_SRC_PLA_ADTRG5           = 437U,     /* PLA_ADTRG5  */
    EVT_SRC_PLA_ADTRG6           = 438U,     /* PLA_ADTRG6  */
    EVT_SRC_PLA_ADTRG7           = 439U,     /* PLA_ADTRG7  */
    EVT_SRC_PLA_ADTRG8           = 440U,     /* PLA_ADTRG8  */
    EVT_SRC_PLA_ADTRG9           = 441U,     /* PLA_ADTRG9  */
    EVT_SRC_PLA_ADTRG10          = 442U,     /* PLA_ADTRG10 */
    EVT_SRC_PLA_ADTRG11          = 443U,     /* PLA_ADTRG11 */
    EVT_SRC_PLA_ADTRG12          = 444U,     /* PLA_ADTRG12 */
    EVT_SRC_PLA_ADTRG13          = 445U,     /* PLA_ADTRG13 */
    EVT_SRC_PLA_ADTRG14          = 446U,     /* PLA_ADTRG14 */
    EVT_SRC_PLA_ADTRG15          = 447U,     /* PLA_ADTRG15 */
    /*  LVD  */
    EVT_SRC_LVD1                 = 465U,     /* LVD1 */
    EVT_SRC_LVD2                 = 466U,     /* LVD2 */
    /*  WDT  */
    EVT_SRC_WDT_REFUDF           = 471U,     /* WDT_REFUDF */
    /*  ADC1  */
    EVT_SRC_ADC1_EOCA            = 480U,     /* ADC_1_EOCA */
    EVT_SRC_ADC1_EOCB            = 481U,     /* ADC_1_EOCB */
    EVT_SRC_ADC1_CMP0            = 482U,     /* ADC_1_CMP0 */
    EVT_SRC_ADC1_CMP1            = 483U,     /* ADC_1_CMP1 */
    /*  ADC2  */
    EVT_SRC_ADC2_EOCA            = 484U,     /* ADC_2_EOCA */
    EVT_SRC_ADC2_EOCB            = 485U,     /* ADC_2_EOCB */
    EVT_SRC_ADC2_CMP0            = 486U,     /* ADC_2_CMP0 */
    EVT_SRC_ADC2_CMP1            = 487U,     /* ADC_2_CMP1 */
    /*  ADC3  */
    EVT_SRC_ADC3_EOCA            = 488U,     /* ADC_3_EOCA */
    EVT_SRC_ADC3_EOCB            = 489U,     /* ADC_3_EOCB */
    EVT_SRC_ADC3_CMP0            = 490U,     /* ADC_3_CMP0 */
    EVT_SRC_ADC3_CMP1            = 491U,     /* ADC_3_CMP1 */
} en_event_src_t;

