MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334FAUI/mcu.h
/*******************************************************************************
                Bit definition for Peripheral FCM
*******************************************************************************/
/*  Bit definition for FCM_LVR register  */
#define FCM_LVR_LVR                                    (0x0000FFFFUL)

/*  Bit definition for FCM_UVR register  */
#define FCM_UVR_UVR                                    (0x0000FFFFUL)

/*  Bit definition for FCM_CNTR register  */
#define FCM_CNTR_CNTR                                  (0x0000FFFFUL)

/*  Bit definition for FCM_STR register  */
#define FCM_STR_START                                  (0x00000001UL)

/*  Bit definition for FCM_MCCR register  */
#define FCM_MCCR_MDIVS_POS                             (0U)
#define FCM_MCCR_MDIVS                                 (0x00000003UL)
#define FCM_MCCR_MDIVS_0                               (0x00000001UL)
#define FCM_MCCR_MDIVS_1                               (0x00000002UL)
#define FCM_MCCR_MCKS_POS                              (4U)
#define FCM_MCCR_MCKS                                  (0x000000F0UL)

/*  Bit definition for FCM_RCCR register  */
#define FCM_RCCR_RDIVS_POS                             (0U)
#define FCM_RCCR_RDIVS                                 (0x00000003UL)
#define FCM_RCCR_RDIVS_0                               (0x00000001UL)
#define FCM_RCCR_RDIVS_1                               (0x00000002UL)
#define FCM_RCCR_RCKS_POS                              (3U)
#define FCM_RCCR_RCKS                                  (0x00000078UL)
#define FCM_RCCR_INEXS_POS                             (7U)
#define FCM_RCCR_INEXS                                 (0x00000080UL)
#define FCM_RCCR_DNFS_POS                              (8U)
#define FCM_RCCR_DNFS                                  (0x00000300UL)
#define FCM_RCCR_DNFS_0                                (0x00000100UL)
#define FCM_RCCR_DNFS_1                                (0x00000200UL)
#define FCM_RCCR_EDGES_POS                             (12U)
#define FCM_RCCR_EDGES                                 (0x00003000UL)
#define FCM_RCCR_EDGES_0                               (0x00001000UL)
#define FCM_RCCR_EDGES_1                               (0x00002000UL)
#define FCM_RCCR_EXREFE_POS                            (15U)
#define FCM_RCCR_EXREFE                                (0x00008000UL)

/*  Bit definition for FCM_RIER register  */
#define FCM_RIER_ERRIE_POS                             (0U)
#define FCM_RIER_ERRIE                                 (0x00000001UL)
#define FCM_RIER_MENDIE_POS                            (1U)
#define FCM_RIER_MENDIE                                (0x00000002UL)
#define FCM_RIER_OVFIE_POS                             (2U)
#define FCM_RIER_OVFIE                                 (0x00000004UL)
#define FCM_RIER_ERRINTRS_POS                          (4U)
#define FCM_RIER_ERRINTRS                              (0x00000010UL)
#define FCM_RIER_ERRE_POS                              (7U)
#define FCM_RIER_ERRE                                  (0x00000080UL)

/*  Bit definition for FCM_SR register  */
#define FCM_SR_ERRF_POS                                (0U)
#define FCM_SR_ERRF                                    (0x00000001UL)
#define FCM_SR_MENDF_POS                               (1U)
#define FCM_SR_MENDF                                   (0x00000002UL)
#define FCM_SR_OVF_POS                                 (2U)
#define FCM_SR_OVF                                     (0x00000004UL)

/*  Bit definition for FCM_CLR register  */
#define FCM_CLR_ERRFCLR_POS                            (0U)
#define FCM_CLR_ERRFCLR                                (0x00000001UL)
#define FCM_CLR_MENDFCLR_POS                           (1U)
#define FCM_CLR_MENDFCLR                               (0x00000002UL)
#define FCM_CLR_OVFCLR_POS                             (2U)
#define FCM_CLR_OVFCLR                                 (0x00000004UL)

/*******************************************************************************
                Bit definition for Peripheral GPIO
*******************************************************************************/
/*  Bit definition for GPIO_PIDRA register  */
#define GPIO_PIDRA_PIN00_POS                           (0U)
#define GPIO_PIDRA_PIN00                               (0x0001U)
#define GPIO_PIDRA_PIN01_POS                           (1U)
#define GPIO_PIDRA_PIN01                               (0x0002U)
#define GPIO_PIDRA_PIN02_POS                           (2U)
#define GPIO_PIDRA_PIN02                               (0x0004U)
#define GPIO_PIDRA_PIN03_POS                           (3U)
#define GPIO_PIDRA_PIN03                               (0x0008U)
#define GPIO_PIDRA_PIN04_POS                           (4U)
#define GPIO_PIDRA_PIN04                               (0x0010U)
#define GPIO_PIDRA_PIN05_POS                           (5U)
#define GPIO_PIDRA_PIN05                               (0x0020U)
#define GPIO_PIDRA_PIN06_POS                           (6U)
#define GPIO_PIDRA_PIN06                               (0x0040U)
#define GPIO_PIDRA_PIN07_POS                           (7U)
#define GPIO_PIDRA_PIN07                               (0x0080U)
#define GPIO_PIDRA_PIN08_POS                           (8U)
#define GPIO_PIDRA_PIN08                               (0x0100U)
#define GPIO_PIDRA_PIN09_POS                           (9U)
#define GPIO_PIDRA_PIN09                               (0x0200U)
#define GPIO_PIDRA_PIN10_POS                           (10U)
#define GPIO_PIDRA_PIN10                               (0x0400U)
#define GPIO_PIDRA_PIN11_POS                           (11U)
#define GPIO_PIDRA_PIN11                               (0x0800U)
#define GPIO_PIDRA_PIN12_POS                           (12U)
#define GPIO_PIDRA_PIN12                               (0x1000U)
#define GPIO_PIDRA_PIN13_POS                           (13U)
#define GPIO_PIDRA_PIN13                               (0x2000U)
#define GPIO_PIDRA_PIN14_POS                           (14U)
#define GPIO_PIDRA_PIN14                               (0x4000U)
#define GPIO_PIDRA_PIN15_POS                           (15U)
#define GPIO_PIDRA_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRA register  */
#define GPIO_PODRA_POUT00_POS                          (0U)
#define GPIO_PODRA_POUT00                              (0x0001U)
#define GPIO_PODRA_POUT01_POS                          (1U)
#define GPIO_PODRA_POUT01                              (0x0002U)
#define GPIO_PODRA_POUT02_POS                          (2U)
#define GPIO_PODRA_POUT02                              (0x0004U)
#define GPIO_PODRA_POUT03_POS                          (3U)
#define GPIO_PODRA_POUT03                              (0x0008U)
#define GPIO_PODRA_POUT04_POS                          (4U)
#define GPIO_PODRA_POUT04                              (0x0010U)
#define GPIO_PODRA_POUT05_POS                          (5U)
#define GPIO_PODRA_POUT05                              (0x0020U)
#define GPIO_PODRA_POUT06_POS                          (6U)
#define GPIO_PODRA_POUT06                              (0x0040U)
#define GPIO_PODRA_POUT07_POS                          (7U)
#define GPIO_PODRA_POUT07                              (0x0080U)
#define GPIO_PODRA_POUT08_POS                          (8U)
#define GPIO_PODRA_POUT08                              (0x0100U)
#define GPIO_PODRA_POUT09_POS                          (9U)
#define GPIO_PODRA_POUT09                              (0x0200U)
#define GPIO_PODRA_POUT10_POS                          (10U)
#define GPIO_PODRA_POUT10                              (0x0400U)
#define GPIO_PODRA_POUT11_POS                          (11U)
#define GPIO_PODRA_POUT11                              (0x0800U)
#define GPIO_PODRA_POUT12_POS                          (12U)
#define GPIO_PODRA_POUT12                              (0x1000U)
#define GPIO_PODRA_POUT13_POS                          (13U)
#define GPIO_PODRA_POUT13                              (0x2000U)
#define GPIO_PODRA_POUT14_POS                          (14U)
#define GPIO_PODRA_POUT14                              (0x4000U)
#define GPIO_PODRA_POUT15_POS                          (15U)
#define GPIO_PODRA_POUT15                              (0x8000U)

/*  Bit definition for GPIO_POERA register  */
#define GPIO_POERA_POUTE00_POS                         (0U)
#define GPIO_POERA_POUTE00                             (0x0001U)
#define GPIO_POERA_POUTE01_POS                         (1U)
#define GPIO_POERA_POUTE01                             (0x0002U)
#define GPIO_POERA_POUTE02_POS                         (2U)
#define GPIO_POERA_POUTE02                             (0x0004U)
#define GPIO_POERA_POUTE03_POS                         (3U)
#define GPIO_POERA_POUTE03                             (0x0008U)
#define GPIO_POERA_POUTE04_POS                         (4U)
#define GPIO_POERA_POUTE04                             (0x0010U)
#define GPIO_POERA_POUTE05_POS                         (5U)
#define GPIO_POERA_POUTE05                             (0x0020U)
#define GPIO_POERA_POUTE06_POS                         (6U)
#define GPIO_POERA_POUTE06                             (0x0040U)
#define GPIO_POERA_POUTE07_POS                         (7U)
#define GPIO_POERA_POUTE07                             (0x0080U)
#define GPIO_POERA_POUTE08_POS                         (8U)
#define GPIO_POERA_POUTE08                             (0x0100U)
#define GPIO_POERA_POUTE09_POS                         (9U)
#define GPIO_POERA_POUTE09                             (0x0200U)
#define GPIO_POERA_POUTE10_POS                         (10U)
#define GPIO_POERA_POUTE10                             (0x0400U)
#define GPIO_POERA_POUTE11_POS                         (11U)
#define GPIO_POERA_POUTE11                             (0x0800U)
#define GPIO_POERA_POUTE12_POS                         (12U)
#define GPIO_POERA_POUTE12                             (0x1000U)
#define GPIO_POERA_POUTE13_POS                         (13U)
#define GPIO_POERA_POUTE13                             (0x2000U)
#define GPIO_POERA_POUTE14_POS                         (14U)
#define GPIO_POERA_POUTE14                             (0x4000U)
#define GPIO_POERA_POUTE15_POS                         (15U)
#define GPIO_POERA_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRA register  */
#define GPIO_POSRA_POS00_POS                           (0U)
#define GPIO_POSRA_POS00                               (0x0001U)
#define GPIO_POSRA_POS01_POS                           (1U)
#define GPIO_POSRA_POS01                               (0x0002U)
#define GPIO_POSRA_POS02_POS                           (2U)
#define GPIO_POSRA_POS02                               (0x0004U)
#define GPIO_POSRA_POS03_POS                           (3U)
#define GPIO_POSRA_POS03                               (0x0008U)
#define GPIO_POSRA_POS04_POS                           (4U)
#define GPIO_POSRA_POS04                               (0x0010U)
#define GPIO_POSRA_POS05_POS                           (5U)
#define GPIO_POSRA_POS05                               (0x0020U)
#define GPIO_POSRA_POS06_POS                           (6U)
#define GPIO_POSRA_POS06                               (0x0040U)
#define GPIO_POSRA_POS07_POS                           (7U)
#define GPIO_POSRA_POS07                               (0x0080U)
#define GPIO_POSRA_POS08_POS                           (8U)
#define GPIO_POSRA_POS08                               (0x0100U)
#define GPIO_POSRA_POS09_POS                           (9U)
#define GPIO_POSRA_POS09                               (0x0200U)
#define GPIO_POSRA_POS10_POS                           (10U)
#define GPIO_POSRA_POS10                               (0x0400U)
#define GPIO_POSRA_POS11_POS                           (11U)
#define GPIO_POSRA_POS11                               (0x0800U)
#define GPIO_POSRA_POS12_POS                           (12U)
#define GPIO_POSRA_POS12                               (0x1000U)
#define GPIO_POSRA_POS13_POS                           (13U)
#define GPIO_POSRA_POS13                               (0x2000U)
#define GPIO_POSRA_POS14_POS                           (14U)
#define GPIO_POSRA_POS14                               (0x4000U)
#define GPIO_POSRA_POS15_POS                           (15U)
#define GPIO_POSRA_POS15                               (0x8000U)

