MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334FAUI/mcu.h
/*  Bit definition for HRPWM_CR register  */
#define HRPWM_CR_EN_POS                                (3U)
#define HRPWM_CR_EN                                    (0x00000008UL)
#define HRPWM_CR_DACSYNC1_POS                          (4U)
#define HRPWM_CR_DACSYNC1                              (0x00000030UL)
#define HRPWM_CR_DACSYNC1_0                            (0x00000010UL)
#define HRPWM_CR_DACSYNC1_1                            (0x00000020UL)
#define HRPWM_CR_DACSYNC2_POS                          (8U)
#define HRPWM_CR_DACSYNC2                              (0x00000300UL)
#define HRPWM_CR_DACSYNC2_0                            (0x00000100UL)
#define HRPWM_CR_DACSYNC2_1                            (0x00000200UL)
#define HRPWM_CR_DACSRC_POS                            (12U)
#define HRPWM_CR_DACSRC                                (0x00007000UL)

/*  Bit definition for HRPWM_PHSCTL register  */
#define HRPWM_PHSCTL_PHSEN_POS                         (0U)
#define HRPWM_PHSCTL_PHSEN                             (0x00000001UL)
#define HRPWM_PHSCTL_PHCMPSEL_POS                      (1U)
#define HRPWM_PHSCTL_PHCMPSEL                          (0x0000000EUL)
#define HRPWM_PHSCTL_PHSFORCA_POS                      (6U)
#define HRPWM_PHSCTL_PHSFORCA                          (0x00000040UL)
#define HRPWM_PHSCTL_PHSFORCB_POS                      (7U)
#define HRPWM_PHSCTL_PHSFORCB                          (0x00000080UL)
#define HRPWM_PHSCTL_BENPHS_POS                        (8U)
#define HRPWM_PHSCTL_BENPHS                            (0x00000100UL)
#define HRPWM_PHSCTL_BTRUPHS_POS                       (9U)
#define HRPWM_PHSCTL_BTRUPHS                           (0x00000200UL)
#define HRPWM_PHSCTL_BTRDPHS_POS                       (10U)
#define HRPWM_PHSCTL_BTRDPHS                           (0x00000400UL)

/*  Bit definition for HRPWM_PHSCMP1A register  */
#define HRPWM_PHSCMP1A_PHSCMP1A                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP1B register  */
#define HRPWM_PHSCMP1B_PHSCMP1B                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP2A register  */
#define HRPWM_PHSCMP2A_PHSCMP2A                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP2B register  */
#define HRPWM_PHSCMP2B_PHSCMP2B                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP3A register  */
#define HRPWM_PHSCMP3A_PHSCMP3A                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP3B register  */
#define HRPWM_PHSCMP3B_PHSCMP3B                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP4A register  */
#define HRPWM_PHSCMP4A_PHSCMP4A                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP4B register  */
#define HRPWM_PHSCMP4B_PHSCMP4B                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP5A register  */
#define HRPWM_PHSCMP5A_PHSCMP5A                        (0x007FFFFFUL)

/*  Bit definition for HRPWM_PHSCMP5B register  */
#define HRPWM_PHSCMP5B_PHSCMP5B                        (0x007FFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral HRPWM_COMMON
*******************************************************************************/
/*  Bit definition for HRPWM_COMMON_CALCR register  */
#define HRPWM_COMMON_CALCR_CAL_POS                     (0U)
#define HRPWM_COMMON_CALCR_CAL                         (0x00000001UL)
#define HRPWM_COMMON_CALCR_CALEN_POS                   (1U)
#define HRPWM_COMMON_CALCR_CALEN                       (0x00000002UL)
#define HRPWM_COMMON_CALCR_CALPRD_POS                  (2U)
#define HRPWM_COMMON_CALCR_CALPRD                      (0x0000003CUL)
#define HRPWM_COMMON_CALCR_CALENF_POS                  (8U)
#define HRPWM_COMMON_CALCR_CALENF                      (0x00000100UL)
#define HRPWM_COMMON_CALCR_ERRF_POS                    (9U)
#define HRPWM_COMMON_CALCR_ERRF                        (0x00000200UL)
#define HRPWM_COMMON_CALCR_CALIE_POS                   (10U)
#define HRPWM_COMMON_CALCR_CALIE                       (0x00000400UL)

/*  Bit definition for HRPWM_COMMON_SCAPR register  */
#define HRPWM_COMMON_SCAPR_SCAP1A_POS                  (0U)
#define HRPWM_COMMON_SCAPR_SCAP1A                      (0x00000001UL)
#define HRPWM_COMMON_SCAPR_SCAP1B_POS                  (1U)
#define HRPWM_COMMON_SCAPR_SCAP1B                      (0x00000002UL)
#define HRPWM_COMMON_SCAPR_SCAP2A_POS                  (2U)
#define HRPWM_COMMON_SCAPR_SCAP2A                      (0x00000004UL)
#define HRPWM_COMMON_SCAPR_SCAP2B_POS                  (3U)
#define HRPWM_COMMON_SCAPR_SCAP2B                      (0x00000008UL)
#define HRPWM_COMMON_SCAPR_SCAP3A_POS                  (4U)
#define HRPWM_COMMON_SCAPR_SCAP3A                      (0x00000010UL)
#define HRPWM_COMMON_SCAPR_SCAP3B_POS                  (5U)
#define HRPWM_COMMON_SCAPR_SCAP3B                      (0x00000020UL)
#define HRPWM_COMMON_SCAPR_SCAP4A_POS                  (6U)
#define HRPWM_COMMON_SCAPR_SCAP4A                      (0x00000040UL)
#define HRPWM_COMMON_SCAPR_SCAP4B_POS                  (7U)
#define HRPWM_COMMON_SCAPR_SCAP4B                      (0x00000080UL)
#define HRPWM_COMMON_SCAPR_SCAP5A_POS                  (8U)
#define HRPWM_COMMON_SCAPR_SCAP5A                      (0x00000100UL)
#define HRPWM_COMMON_SCAPR_SCAP5B_POS                  (9U)
#define HRPWM_COMMON_SCAPR_SCAP5B                      (0x00000200UL)
#define HRPWM_COMMON_SCAPR_SCAP6A_POS                  (10U)
#define HRPWM_COMMON_SCAPR_SCAP6A                      (0x00000400UL)
#define HRPWM_COMMON_SCAPR_SCAP6B_POS                  (11U)
#define HRPWM_COMMON_SCAPR_SCAP6B                      (0x00000800UL)

/*  Bit definition for HRPWM_COMMON_SSTAIDLR register  */
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL1A_POS            (0U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL1A                (0x00000001UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL1B_POS            (1U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL1B                (0x00000002UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL2A_POS            (2U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL2A                (0x00000004UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL2B_POS            (3U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL2B                (0x00000008UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL3A_POS            (4U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL3A                (0x00000010UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL3B_POS            (5U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL3B                (0x00000020UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL4A_POS            (6U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL4A                (0x00000040UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL4B_POS            (7U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL4B                (0x00000080UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL5A_POS            (8U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL5A                (0x00000100UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL5B_POS            (9U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL5B                (0x00000200UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL6A_POS            (10U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL6A                (0x00000400UL)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL6B_POS            (11U)
#define HRPWM_COMMON_SSTAIDLR_SSTAIDL6B                (0x00000800UL)

