MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334FAUI/mcu.h
/*  Bit definition for HRPWM_COMMON_FCNTR register  */
#define HRPWM_COMMON_FCNTR_NOFIENTA_POS                (0U)
#define HRPWM_COMMON_FCNTR_NOFIENTA                    (0x00000001UL)
#define HRPWM_COMMON_FCNTR_NOFICKTA_POS                (1U)
#define HRPWM_COMMON_FCNTR_NOFICKTA                    (0x00000006UL)
#define HRPWM_COMMON_FCNTR_NOFICKTA_0                  (0x00000002UL)
#define HRPWM_COMMON_FCNTR_NOFICKTA_1                  (0x00000004UL)
#define HRPWM_COMMON_FCNTR_NOFIENTB_POS                (4U)
#define HRPWM_COMMON_FCNTR_NOFIENTB                    (0x00000010UL)
#define HRPWM_COMMON_FCNTR_NOFICKTB_POS                (5U)
#define HRPWM_COMMON_FCNTR_NOFICKTB                    (0x00000060UL)
#define HRPWM_COMMON_FCNTR_NOFICKTB_0                  (0x00000020UL)
#define HRPWM_COMMON_FCNTR_NOFICKTB_1                  (0x00000040UL)
#define HRPWM_COMMON_FCNTR_NOFIENTC_POS                (8U)
#define HRPWM_COMMON_FCNTR_NOFIENTC                    (0x00000100UL)
#define HRPWM_COMMON_FCNTR_NOFICKTC_POS                (9U)
#define HRPWM_COMMON_FCNTR_NOFICKTC                    (0x00000600UL)
#define HRPWM_COMMON_FCNTR_NOFICKTC_0                  (0x00000200UL)
#define HRPWM_COMMON_FCNTR_NOFICKTC_1                  (0x00000400UL)
#define HRPWM_COMMON_FCNTR_NOFIENTD_POS                (12U)
#define HRPWM_COMMON_FCNTR_NOFIENTD                    (0x00001000UL)
#define HRPWM_COMMON_FCNTR_NOFICKTD_POS                (13U)
#define HRPWM_COMMON_FCNTR_NOFICKTD                    (0x00006000UL)
#define HRPWM_COMMON_FCNTR_NOFICKTD_0                  (0x00002000UL)
#define HRPWM_COMMON_FCNTR_NOFICKTD_1                  (0x00004000UL)

/*  Bit definition for HRPWM_COMMON_SSTAR register  */
#define HRPWM_COMMON_SSTAR_SSTA1_POS                   (0U)
#define HRPWM_COMMON_SSTAR_SSTA1                       (0x00000001UL)
#define HRPWM_COMMON_SSTAR_SSTA2_POS                   (1U)
#define HRPWM_COMMON_SSTAR_SSTA2                       (0x00000002UL)
#define HRPWM_COMMON_SSTAR_SSTA3_POS                   (2U)
#define HRPWM_COMMON_SSTAR_SSTA3                       (0x00000004UL)
#define HRPWM_COMMON_SSTAR_SSTA4_POS                   (3U)
#define HRPWM_COMMON_SSTAR_SSTA4                       (0x00000008UL)
#define HRPWM_COMMON_SSTAR_SSTA5_POS                   (4U)
#define HRPWM_COMMON_SSTAR_SSTA5                       (0x00000010UL)
#define HRPWM_COMMON_SSTAR_SSTA6_POS                   (5U)
#define HRPWM_COMMON_SSTAR_SSTA6                       (0x00000020UL)

/*  Bit definition for HRPWM_COMMON_SSTPR register  */
#define HRPWM_COMMON_SSTPR_SSTP1_POS                   (0U)
#define HRPWM_COMMON_SSTPR_SSTP1                       (0x00000001UL)
#define HRPWM_COMMON_SSTPR_SSTP2_POS                   (1U)
#define HRPWM_COMMON_SSTPR_SSTP2                       (0x00000002UL)
#define HRPWM_COMMON_SSTPR_SSTP3_POS                   (2U)
#define HRPWM_COMMON_SSTPR_SSTP3                       (0x00000004UL)
#define HRPWM_COMMON_SSTPR_SSTP4_POS                   (3U)
#define HRPWM_COMMON_SSTPR_SSTP4                       (0x00000008UL)
#define HRPWM_COMMON_SSTPR_SSTP5_POS                   (4U)
#define HRPWM_COMMON_SSTPR_SSTP5                       (0x00000010UL)
#define HRPWM_COMMON_SSTPR_SSTP6_POS                   (5U)
#define HRPWM_COMMON_SSTPR_SSTP6                       (0x00000020UL)

/*  Bit definition for HRPWM_COMMON_SCLRR register  */
#define HRPWM_COMMON_SCLRR_SCLE1_POS                   (0U)
#define HRPWM_COMMON_SCLRR_SCLE1                       (0x00000001UL)
#define HRPWM_COMMON_SCLRR_SCLE2_POS                   (1U)
#define HRPWM_COMMON_SCLRR_SCLE2                       (0x00000002UL)
#define HRPWM_COMMON_SCLRR_SCLE3_POS                   (2U)
#define HRPWM_COMMON_SCLRR_SCLE3                       (0x00000004UL)
#define HRPWM_COMMON_SCLRR_SCLE4_POS                   (3U)
#define HRPWM_COMMON_SCLRR_SCLE4                       (0x00000008UL)
#define HRPWM_COMMON_SCLRR_SCLE5_POS                   (4U)
#define HRPWM_COMMON_SCLRR_SCLE5                       (0x00000010UL)
#define HRPWM_COMMON_SCLRR_SCLE6_POS                   (5U)
#define HRPWM_COMMON_SCLRR_SCLE6                       (0x00000020UL)

/*  Bit definition for HRPWM_COMMON_SUPDR register  */
#define HRPWM_COMMON_SUPDR_SUPD1_POS                   (0U)
#define HRPWM_COMMON_SUPDR_SUPD1                       (0x00000001UL)
#define HRPWM_COMMON_SUPDR_SUPD2_POS                   (1U)
#define HRPWM_COMMON_SUPDR_SUPD2                       (0x00000002UL)
#define HRPWM_COMMON_SUPDR_SUPD3_POS                   (2U)
#define HRPWM_COMMON_SUPDR_SUPD3                       (0x00000004UL)
#define HRPWM_COMMON_SUPDR_SUPD4_POS                   (3U)
#define HRPWM_COMMON_SUPDR_SUPD4                       (0x00000008UL)
#define HRPWM_COMMON_SUPDR_SUPD5_POS                   (4U)
#define HRPWM_COMMON_SUPDR_SUPD5                       (0x00000010UL)
#define HRPWM_COMMON_SUPDR_SUPD6_POS                   (5U)
#define HRPWM_COMMON_SUPDR_SUPD6                       (0x00000020UL)

/*******************************************************************************
                Bit definition for Peripheral I2C
*******************************************************************************/
/*  Bit definition for I2C_CR1 register  */
#define I2C_CR1_PE_POS                                 (0U)
#define I2C_CR1_PE                                     (0x00000001UL)
#define I2C_CR1_SMBUS_POS                              (1U)
#define I2C_CR1_SMBUS                                  (0x00000002UL)
#define I2C_CR1_SMBALRTEN_POS                          (2U)
#define I2C_CR1_SMBALRTEN                              (0x00000004UL)
#define I2C_CR1_SMBDEFAULTEN_POS                       (3U)
#define I2C_CR1_SMBDEFAULTEN                           (0x00000008UL)
#define I2C_CR1_SMBHOSTEN_POS                          (4U)
#define I2C_CR1_SMBHOSTEN                              (0x00000010UL)
#define I2C_CR1_GCEN_POS                               (6U)
#define I2C_CR1_GCEN                                   (0x00000040UL)
#define I2C_CR1_RESTART_POS                            (7U)
#define I2C_CR1_RESTART                                (0x00000080UL)
#define I2C_CR1_START_POS                              (8U)
#define I2C_CR1_START                                  (0x00000100UL)
#define I2C_CR1_STOP_POS                               (9U)
#define I2C_CR1_STOP                                   (0x00000200UL)
#define I2C_CR1_ACK_POS                                (10U)
#define I2C_CR1_ACK                                    (0x00000400UL)
#define I2C_CR1_SWRST_POS                              (15U)
#define I2C_CR1_SWRST                                  (0x00008000UL)

/*  Bit definition for I2C_CR2 register  */
#define I2C_CR2_STARTIE_POS                            (0U)
#define I2C_CR2_STARTIE                                (0x00000001UL)
#define I2C_CR2_SLADDR0IE_POS                          (1U)
#define I2C_CR2_SLADDR0IE                              (0x00000002UL)
#define I2C_CR2_SLADDR1IE_POS                          (2U)
#define I2C_CR2_SLADDR1IE                              (0x00000004UL)
#define I2C_CR2_TENDIE_POS                             (3U)
#define I2C_CR2_TENDIE                                 (0x00000008UL)
#define I2C_CR2_STOPIE_POS                             (4U)
#define I2C_CR2_STOPIE                                 (0x00000010UL)
#define I2C_CR2_RFULLIE_POS                            (6U)
#define I2C_CR2_RFULLIE                                (0x00000040UL)
#define I2C_CR2_TEMPTYIE_POS                           (7U)
#define I2C_CR2_TEMPTYIE                               (0x00000080UL)
#define I2C_CR2_ARLOIE_POS                             (9U)
#define I2C_CR2_ARLOIE                                 (0x00000200UL)
#define I2C_CR2_RFREQIE_POS                            (11U)
#define I2C_CR2_RFREQIE                                (0x00000800UL)
#define I2C_CR2_NACKIE_POS                             (12U)
#define I2C_CR2_NACKIE                                 (0x00001000UL)
#define I2C_CR2_TMOUTIE_POS                            (14U)
#define I2C_CR2_TMOUTIE                                (0x00004000UL)
#define I2C_CR2_GENCALLIE_POS                          (20U)
#define I2C_CR2_GENCALLIE                              (0x00100000UL)
#define I2C_CR2_SMBDEFAULTIE_POS                       (21U)
#define I2C_CR2_SMBDEFAULTIE                           (0x00200000UL)
#define I2C_CR2_SMBHOSTIE_POS                          (22U)
#define I2C_CR2_SMBHOSTIE                              (0x00400000UL)
#define I2C_CR2_SMBALRTIE_POS                          (23U)
#define I2C_CR2_SMBALRTIE                              (0x00800000UL)

/*  Bit definition for I2C_CR3 register  */
#define I2C_CR3_TMOUTEN_POS                            (0U)
#define I2C_CR3_TMOUTEN                                (0x00000001UL)
#define I2C_CR3_LTMOUT_POS                             (1U)
#define I2C_CR3_LTMOUT                                 (0x00000002UL)
#define I2C_CR3_HTMOUT_POS                             (2U)
#define I2C_CR3_HTMOUT                                 (0x00000004UL)
#define I2C_CR3_FACKEN_POS                             (7U)
#define I2C_CR3_FACKEN                                 (0x00000080UL)

/*  Bit definition for I2C_CR4 register  */
#define I2C_CR4_BUSWAIT_POS                            (10U)
#define I2C_CR4_BUSWAIT                                (0x00000400UL)
#define I2C_CR4_BUSFREECLREN_POS                       (12U)
#define I2C_CR4_BUSFREECLREN                           (0x00001000UL)

/*  Bit definition for I2C_SLR0 register  */
#define I2C_SLR0_SLADDR0_POS                           (0U)
#define I2C_SLR0_SLADDR0                               (0x000003FFUL)
#define I2C_SLR0_SLADDR0EN_POS                         (12U)
#define I2C_SLR0_SLADDR0EN                             (0x00001000UL)
#define I2C_SLR0_ADDRMOD0_POS                          (15U)
#define I2C_SLR0_ADDRMOD0                              (0x00008000UL)
#define I2C_SLR0_MSLADDR0_POS                          (16U)
#define I2C_SLR0_MSLADDR0                              (0x03FF0000UL)
#define I2C_SLR0_MASKEN0_POS                           (26U)
#define I2C_SLR0_MASKEN0                               (0x04000000UL)

