MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334FAUI/mcu.h
/*  Bit definition for MCAN_TXEFC register  */
#define MCAN_TXEFC_EFSA_POS                            (2U)
#define MCAN_TXEFC_EFSA                                (0x0000FFFCUL)
#define MCAN_TXEFC_EFS_POS                             (16U)
#define MCAN_TXEFC_EFS                                 (0x003F0000UL)
#define MCAN_TXEFC_EFWM_POS                            (24U)
#define MCAN_TXEFC_EFWM                                (0x3F000000UL)

/*  Bit definition for MCAN_TXEFS register  */
#define MCAN_TXEFS_EFFL_POS                            (0U)
#define MCAN_TXEFS_EFFL                                (0x0000003FUL)
#define MCAN_TXEFS_EFGI_POS                            (8U)
#define MCAN_TXEFS_EFGI                                (0x00001F00UL)
#define MCAN_TXEFS_EFPI_POS                            (16U)
#define MCAN_TXEFS_EFPI                                (0x001F0000UL)
#define MCAN_TXEFS_EFF_POS                             (24U)
#define MCAN_TXEFS_EFF                                 (0x01000000UL)
#define MCAN_TXEFS_TEFL_POS                            (25U)
#define MCAN_TXEFS_TEFL                                (0x02000000UL)

/*  Bit definition for MCAN_TXEFA register  */
#define MCAN_TXEFA_EFAI                                (0x0000001FUL)

/*******************************************************************************
                Bit definition for Peripheral MCANRAM
*******************************************************************************/
/*  Bit definition for MCANRAM_CKCR register  */
#define MCANRAM_CKCR_ECCMOD                            (0x00000003UL)
#define MCANRAM_CKCR_ECCMOD_0                          (0x00000001UL)
#define MCANRAM_CKCR_ECCMOD_1                          (0x00000002UL)

/*  Bit definition for MCANRAM_CKSR register  */
#define MCANRAM_CKSR_RAM_1ERR_POS                      (0U)
#define MCANRAM_CKSR_RAM_1ERR                          (0x00000001UL)
#define MCANRAM_CKSR_RAM_2ERR_POS                      (1U)
#define MCANRAM_CKSR_RAM_2ERR                          (0x00000002UL)

/*  Bit definition for MCANRAM_EIEN register  */
#define MCANRAM_EIEN_EIEN                              (0x00000001UL)

/*  Bit definition for MCANRAM_EIBIT0 register  */
#define MCANRAM_EIBIT0                                 (0xFFFFFFFFUL)

/*  Bit definition for MCANRAM_EIBIT1 register  */
#define MCANRAM_EIBIT1_EIBIT                           (0x0000007FUL)

/*  Bit definition for MCANRAM_ECCERRADDR register  */
#define MCANRAM_ECCERRADDR_ECCERRADDR                  (0x000001FFUL)

/*******************************************************************************
                Bit definition for Peripheral MPU
*******************************************************************************/
/*  Bit definition for MPU_RGD register  */
#define MPU_RGD_MPURGSIZE_POS                          (0U)
#define MPU_RGD_MPURGSIZE                              (0x0000001FUL)
#define MPU_RGD_MPURGADDR_POS                          (5U)
#define MPU_RGD_MPURGADDR                              (0xFFFFFFE0UL)

/*  Bit definition for MPU_SR register  */
#define MPU_SR_SMPU1EAF_POS                            (0U)
#define MPU_SR_SMPU1EAF                                (0x00000001UL)
#define MPU_SR_PSPEF_POS                               (1U)
#define MPU_SR_PSPEF                                   (0x00000002UL)
#define MPU_SR_MSPEF_POS                               (2U)
#define MPU_SR_MSPEF                                   (0x00000004UL)

/*  Bit definition for MPU_ECLR register  */
#define MPU_ECLR_SMPU1ECLR_POS                         (0U)
#define MPU_ECLR_SMPU1ECLR                             (0x00000001UL)
#define MPU_ECLR_PSPECLR_POS                           (1U)
#define MPU_ECLR_PSPECLR                               (0x00000002UL)
#define MPU_ECLR_MSPECLR_POS                           (2U)
#define MPU_ECLR_MSPECLR                               (0x00000004UL)

/*  Bit definition for MPU_WP register  */
#define MPU_WP_MPUWE_POS                               (0U)
#define MPU_WP_MPUWE                                   (0x00000001UL)
#define MPU_WP_WKEY_POS                                (1U)
#define MPU_WP_WKEY                                    (0x0000FFFEUL)

/*  Bit definition for MPU_IPPR register  */
#define MPU_IPPR_CRCRDP_POS                            (6U)
#define MPU_IPPR_CRCRDP                                (0x00000040UL)
#define MPU_IPPR_CRCWRP_POS                            (7U)
#define MPU_IPPR_CRCWRP                                (0x00000080UL)
#define MPU_IPPR_EFMRDP_POS                            (8U)
#define MPU_IPPR_EFMRDP                                (0x00000100UL)
#define MPU_IPPR_EFMWRP_POS                            (9U)
#define MPU_IPPR_EFMWRP                                (0x00000200UL)
#define MPU_IPPR_WDTRDP_POS                            (12U)
#define MPU_IPPR_WDTRDP                                (0x00001000UL)
#define MPU_IPPR_WDTWRP_POS                            (13U)
#define MPU_IPPR_WDTWRP                                (0x00002000UL)
#define MPU_IPPR_SWDTRDP_POS                           (14U)
#define MPU_IPPR_SWDTRDP                               (0x00004000UL)
#define MPU_IPPR_SWDTWRP_POS                           (15U)
#define MPU_IPPR_SWDTWRP                               (0x00008000UL)
#define MPU_IPPR_BKSRAMRDP_POS                         (16U)
#define MPU_IPPR_BKSRAMRDP                             (0x00010000UL)
#define MPU_IPPR_BKSRAMWRP_POS                         (17U)
#define MPU_IPPR_BKSRAMWRP                             (0x00020000UL)
#define MPU_IPPR_RTCRDP_POS                            (18U)
#define MPU_IPPR_RTCRDP                                (0x00040000UL)
#define MPU_IPPR_RTCWRP_POS                            (19U)
#define MPU_IPPR_RTCWRP                                (0x00080000UL)
#define MPU_IPPR_DMPURDP_POS                           (20U)
#define MPU_IPPR_DMPURDP                               (0x00100000UL)
#define MPU_IPPR_DMPUWRP_POS                           (21U)
#define MPU_IPPR_DMPUWRP                               (0x00200000UL)
#define MPU_IPPR_SRAMCRDP_POS                          (22U)
#define MPU_IPPR_SRAMCRDP                              (0x00400000UL)
#define MPU_IPPR_SRAMCWRP_POS                          (23U)
#define MPU_IPPR_SRAMCWRP                              (0x00800000UL)
#define MPU_IPPR_INTCRDP_POS                           (24U)
#define MPU_IPPR_INTCRDP                               (0x01000000UL)
#define MPU_IPPR_INTCWRP_POS                           (25U)
#define MPU_IPPR_INTCWRP                               (0x02000000UL)
#define MPU_IPPR_SYSCRDP_POS                           (26U)
#define MPU_IPPR_SYSCRDP                               (0x04000000UL)
#define MPU_IPPR_SYSCWRP_POS                           (27U)
#define MPU_IPPR_SYSCWRP                               (0x08000000UL)
#define MPU_IPPR_MSTPRDP_POS                           (28U)
#define MPU_IPPR_MSTPRDP                               (0x10000000UL)
#define MPU_IPPR_MSPTWRP_POS                           (29U)
#define MPU_IPPR_MSPTWRP                               (0x20000000UL)
#define MPU_IPPR_BUSERRE_POS                           (31U)
#define MPU_IPPR_BUSERRE                               (0x80000000UL)

/*  Bit definition for MPU_MSPPBA register  */
#define MPU_MSPPBA_MSPPBA_POS                          (2U)
#define MPU_MSPPBA_MSPPBA                              (0xFFFFFFFCUL)

