MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334FAUI/mcu.h
typedef struct {
    __IO uint32_t HSTAEXEV1;
    __IO uint32_t HSTAEXEV2;
    __IO uint32_t HSTAEXEV3;
    __IO uint32_t HSTAEXEV4;
    __IO uint32_t HSTAEXEV5;
    __IO uint32_t HSTAEXEV6;
    __IO uint32_t HSTAEXEV7;
    __IO uint32_t HSTAEXEV8;
    __IO uint32_t HSTAEXEV9;
    __IO uint32_t HSTAEXEV10;
    __IO uint32_t HSTAGCMA1;
    __IO uint32_t HSTAGCMB1;
    __IO uint32_t HSTAGCMA2;
    __IO uint32_t HSTAGCMB2;
    __IO uint32_t HSTAGCMA3;
    __IO uint32_t HSTAGCMB3;
    __IO uint32_t HSTAGCMA4;
    __IO uint32_t HSTAGCMB4;
    __IO uint32_t HSTAGCMA5;
    __IO uint32_t HSTAGCMB5;
    __IO uint32_t HSTAGCMA6;
    __IO uint32_t HSTAGCMB6;
    __IO uint32_t HSTASCMA1;
    __IO uint32_t HSTASCMB2;
    __IO uint32_t HSTASCMB3;
    __IO uint32_t HSTASCMB4;
    __IO uint32_t HSTASCMB5;
    __IO uint32_t HSTASCMB6;
    uint32_t RESERVED0[4];
} stc_hrpwm_hstar2_bit_t;

typedef struct {
    __IO uint32_t HCLREXEV1;
    __IO uint32_t HCLREXEV2;
    __IO uint32_t HCLREXEV3;
    __IO uint32_t HCLREXEV4;
    __IO uint32_t HCLREXEV5;
    __IO uint32_t HCLREXEV6;
    __IO uint32_t HCLREXEV7;
    __IO uint32_t HCLREXEV8;
    __IO uint32_t HCLREXEV9;
    __IO uint32_t HCLREXEV10;
    __IO uint32_t HCLRGCMA1;
    __IO uint32_t HCLRGCMB1;
    __IO uint32_t HCLRGCMA2;
    __IO uint32_t HCLRGCMB2;
    __IO uint32_t HCLRGCMA3;
    __IO uint32_t HCLRGCMB3;
    __IO uint32_t HCLRGCMA4;
    __IO uint32_t HCLRGCMB4;
    __IO uint32_t HCLRGCMA5;
    __IO uint32_t HCLRGCMB5;
    __IO uint32_t HCLRGCMA6;
    __IO uint32_t HCLRGCMB6;
    __IO uint32_t HCLRSCMB1;
    __IO uint32_t HCLRSCMB2;
    __IO uint32_t HCLRSCMB3;
    __IO uint32_t HCLRSCMB4;
    __IO uint32_t HCLRSCMB5;
    __IO uint32_t HCLRSCMB6;
    uint32_t RESERVED0[4];
} stc_hrpwm_hclrr2_bit_t;

typedef struct {
    uint32_t RESERVED0[22];
    __IO uint32_t OFFSETDIR;
    uint32_t RESERVED1[9];
} stc_hrpwm_eefoffsetar_bit_t;

typedef struct {
    uint32_t RESERVED0[22];
    __IO uint32_t OFFSETDIR;
    uint32_t RESERVED1[9];
} stc_hrpwm_eefoffsetbr_bit_t;

typedef struct {
    uint32_t RESERVED0[22];
    __IO uint32_t WINDIR;
    uint32_t RESERVED1[9];
} stc_hrpwm_eefwinar_bit_t;

typedef struct {
    uint32_t RESERVED0[22];
    __IO uint32_t WINDIR;
    uint32_t RESERVED1[9];
} stc_hrpwm_eefwinbr_bit_t;

typedef struct {
    __IO uint32_t EE1LAT;
    uint32_t RESERVED0[4];
    __IO uint32_t EE1TMO;
    __IO uint32_t EE2LAT;
    uint32_t RESERVED1[4];
    __IO uint32_t EE2TMO;
    __IO uint32_t EE3LAT;
    uint32_t RESERVED2[4];
    __IO uint32_t EE3TMO;
    __IO uint32_t EE4LAT;
    uint32_t RESERVED3[4];
    __IO uint32_t EE4TMO;
    __IO uint32_t EE5LAT;
    uint32_t RESERVED4[4];
    __IO uint32_t EE5TMO;
    __IO uint32_t EEINTPOL;
    uint32_t RESERVED5[1];
} stc_hrpwm_eefltcr1_bit_t;

typedef struct {
    __IO uint32_t EE6LAT;
    uint32_t RESERVED0[4];
    __IO uint32_t EE6TMO;
    __IO uint32_t EE7LAT;
    uint32_t RESERVED1[4];
    __IO uint32_t EE7TMO;
    __IO uint32_t EE8LAT;
    uint32_t RESERVED2[4];
    __IO uint32_t EE8TMO;
    __IO uint32_t EE9LAT;
    uint32_t RESERVED3[4];
    __IO uint32_t EE9TMO;
    __IO uint32_t EE10LAT;
    uint32_t RESERVED4[4];
    __IO uint32_t EE10TMO;
    uint32_t RESERVED5[2];
} stc_hrpwm_eefltcr2_bit_t;

typedef struct {
    __IO uint32_t IDLEBMA;
    __IO uint32_t IDLESA;
    __IO uint32_t DIDLA;
    __IO uint32_t DLYCHA;
    uint32_t RESERVED0[4];
    __IO uint32_t DLYPRTEN;
    uint32_t RESERVED1[3];
    __IO uint32_t DLYSTRG;
    uint32_t RESERVED2[3];
    __IO uint32_t IDLEBMB;
    __IO uint32_t IDLESB;
    __IO uint32_t DIDLB;
    __IO uint32_t DLYCHB;
    uint32_t RESERVED3[4];
    __IO uint32_t INTENDLYPRT;
    __IO uint32_t FOLLOW;
    uint32_t RESERVED4[6];
} stc_hrpwm_idlecr_bit_t;

typedef struct {
    __IO uint32_t INVCAEN;
    __IO uint32_t INVCBEN;
    __IO uint32_t SWAPEN;
    __IO uint32_t SWAPMD;
    __IO uint32_t HALF;
    __IO uint32_t PRDLK;
    __IO uint32_t EEFM;
    __IO uint32_t EEFREF;
    uint32_t RESERVED0[8];
    __IO uint32_t CMSCAUEN;
    __IO uint32_t CMSCADEN;
    __IO uint32_t CMSCBUEN;
    __IO uint32_t CMSCBDEN;
    uint32_t RESERVED1[12];
} stc_hrpwm_gconr1_bit_t;

typedef struct {
    __IO uint32_t INTENA;
    __IO uint32_t INTENB;
    __IO uint32_t INTENC;
    __IO uint32_t INTEND;
    __IO uint32_t INTENE;
    __IO uint32_t INTENF;
    __IO uint32_t INTENOVF;
    __IO uint32_t NTENUDF;
    uint32_t RESERVED0[6];
    __IO uint32_t INTENCAPA;
    __IO uint32_t INTENCAPB;
    __IO uint32_t INTENSAU;
    __IO uint32_t INTENSAD;
    __IO uint32_t INTENSBU;
    __IO uint32_t INTENSBD;
    uint32_t RESERVED1[12];
} stc_hrpwm_biconr_bit_t;

typedef struct {
    uint32_t RESERVED0[28];
    __IO uint32_t OUTENA;
    uint32_t RESERVED1[3];
} stc_hrpwm_bpcnar1_bit_t;

typedef struct {
    uint32_t RESERVED0[28];
    __IO uint32_t OUTENB;
    uint32_t RESERVED1[3];
} stc_hrpwm_bpcnbr1_bit_t;

typedef struct {
    __IO uint32_t INVCAEN;
    __IO uint32_t INVCBEN;
    __IO uint32_t SWAPEN;
    __IO uint32_t SWAPMD;
    __IO uint32_t HALF;
    __IO uint32_t PRDLK;
    __IO uint32_t EEFM;
    __IO uint32_t EEFREF;
    uint32_t RESERVED0[8];
    __IO uint32_t CMSCAUEN;
    __IO uint32_t CMSCADEN;
    __IO uint32_t CMSCBUEN;
    __IO uint32_t CMSCBDEN;
    uint32_t RESERVED1[12];
} stc_hrpwm_bgconr1_bit_t;

typedef struct {
    __IO uint32_t CMSA1;
    __IO uint32_t CMSB1;
    __IO uint32_t OVF1;
    __IO uint32_t UDF1;
    __IO uint32_t CMSA2;
    __IO uint32_t CMSB2;
    __IO uint32_t OVF2;
    __IO uint32_t UDF2;
    __IO uint32_t CMSA3;
    __IO uint32_t CMSB3;
    __IO uint32_t OVF3;
    __IO uint32_t UDF3;
    __IO uint32_t CMSA4;
    __IO uint32_t CMSB4;
    __IO uint32_t OVF4;
    __IO uint32_t UDF4;
    __IO uint32_t CMSA5;
    __IO uint32_t CMSB5;
    __IO uint32_t OVF5;
    __IO uint32_t UDF5;
    __IO uint32_t CMSA6;
    __IO uint32_t CMSB6;
    __IO uint32_t OVF6;
    __IO uint32_t UDF6;
    __IO uint32_t EEVDET;
    uint32_t RESERVED0[7];
} stc_hrpwm_scmaselr_bit_t;

