MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334FAUI/mcu.h
typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t MSPPACT;
    __IO uint32_t MSPPE;
} stc_mpu_msppctl_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t PSPPACT;
    __IO uint32_t PSPPE;
} stc_mpu_psppctl_bit_t;

typedef struct {
    __IO uint32_t RG0E;
    __IO uint32_t RG1E;
    __IO uint32_t RG2E;
    __IO uint32_t RG3E;
    __IO uint32_t RG4E;
    __IO uint32_t RG5E;
    __IO uint32_t RG6E;
    __IO uint32_t RG7E;
    __IO uint32_t RG8E;
    __IO uint32_t RG9E;
    __IO uint32_t RG10E;
    __IO uint32_t RG11E;
    __IO uint32_t RG12E;
    __IO uint32_t RG13E;
    __IO uint32_t RG14E;
    __IO uint32_t RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_srge_bit_t;

typedef struct {
    __IO uint32_t RG0WP;
    __IO uint32_t RG1WP;
    __IO uint32_t RG2WP;
    __IO uint32_t RG3WP;
    __IO uint32_t RG4WP;
    __IO uint32_t RG5WP;
    __IO uint32_t RG6WP;
    __IO uint32_t RG7WP;
    __IO uint32_t RG8WP;
    __IO uint32_t RG9WP;
    __IO uint32_t RG10WP;
    __IO uint32_t RG11WP;
    __IO uint32_t RG12WP;
    __IO uint32_t RG13WP;
    __IO uint32_t RG14WP;
    __IO uint32_t RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_srgwp_bit_t;

typedef struct {
    __IO uint32_t RG0RP;
    __IO uint32_t RG1RP;
    __IO uint32_t RG2RP;
    __IO uint32_t RG3RP;
    __IO uint32_t RG4RP;
    __IO uint32_t RG5RP;
    __IO uint32_t RG6RP;
    __IO uint32_t RG7RP;
    __IO uint32_t RG8RP;
    __IO uint32_t RG9RP;
    __IO uint32_t RG10RP;
    __IO uint32_t RG11RP;
    __IO uint32_t RG12RP;
    __IO uint32_t RG13RP;
    __IO uint32_t RG14RP;
    __IO uint32_t RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_srgrp_bit_t;

typedef struct {
    __IO uint32_t SMPUBRP;
    __IO uint32_t SMPUBWP;
    uint32_t RESERVED0[5];
    __IO uint32_t SMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_scr_bit_t;

typedef struct {
    __IO uint32_t TMR0U1A;
    __IO uint32_t TMR0U1B;
    __IO uint32_t TMR0U2A;
    __IO uint32_t TMR0U2B;
    __IO uint32_t TMR4U1;
    uint32_t RESERVED0[3];
    __IO uint32_t TMR6U1;
    __IO uint32_t TMR6U2;
    __IO uint32_t TMR6U3;
    __IO uint32_t TMR6U4;
    uint32_t RESERVED1[4];
    __IO uint32_t TMRAU1;
    __IO uint32_t TMRAU2;
    __IO uint32_t TMRAU3;
    __IO uint32_t TMRAU4;
    __IO uint32_t TMRAU5;
    uint32_t RESERVED2[3];
    __IO uint32_t HRPWMU1;
    __IO uint32_t HRPWMU2;
    __IO uint32_t HRPWMU3;
    __IO uint32_t HRPWMU4;
    __IO uint32_t HRPWMU5;
    __IO uint32_t HRPWMU6;
    uint32_t RESERVED3[2];
} stc_peric_tmr_synenr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t USART1_NFE;
    uint32_t RESERVED1[29];
} stc_peric_usart1_nfc_bit_t;

typedef struct {
    uint32_t RESERVED0[14];
    __IO uint32_t MUX1_4;
    __IO uint32_t MUX0_4;
    uint32_t RESERVED1[16];
} stc_pla_muxs_bit_t;

typedef struct {
    uint32_t RESERVED0[6];
    __IO uint32_t OEN;
    __IO uint32_t OSEL;
    uint32_t RESERVED1[24];
} stc_pla_ctl_bit_t;

typedef struct {
    __IO uint32_t SRAMH;
    uint32_t RESERVED0[3];
    __IO uint32_t SRAM0;
    uint32_t RESERVED1[5];
    __IO uint32_t SRAMB;
    __IO uint32_t PLA;
    uint32_t RESERVED2[2];
    __IO uint32_t DMA;
    uint32_t RESERVED3[1];
    __IO uint32_t FCM;
    __IO uint32_t AOS;
    __IO uint32_t CTC;
    uint32_t RESERVED4[4];
    __IO uint32_t CRC;
    uint32_t RESERVED5[8];
} stc_pwc_fcg0_bit_t;

typedef struct {
    __IO uint32_t MCAN1;
    __IO uint32_t MCAN2;
    uint32_t RESERVED0[2];
    __IO uint32_t I2C;
    uint32_t RESERVED1[11];
    __IO uint32_t SPI;
    uint32_t RESERVED2[15];
} stc_pwc_fcg1_bit_t;

typedef struct {
    __IO uint32_t TMR6_1;
    __IO uint32_t TMR6_2;
    __IO uint32_t TMR6_3;
    __IO uint32_t TMR6_4;
    __IO uint32_t HRPWM_1;
    __IO uint32_t HRPWM_2;
    __IO uint32_t HRPWM_3;
    __IO uint32_t HRPWM_4;
    __IO uint32_t HRPWM_5;
    __IO uint32_t HRPWM_6;
    __IO uint32_t TMR4;
    uint32_t RESERVED0[1];
    __IO uint32_t TMR0_1;
    __IO uint32_t TMR0_2;
    uint32_t RESERVED1[1];
    __IO uint32_t EMB;
    uint32_t RESERVED2[4];
    __IO uint32_t TMRA_1;
    __IO uint32_t TMRA_2;
    __IO uint32_t TMRA_3;
    __IO uint32_t TMRA_4;
    __IO uint32_t TMRA_5;
    uint32_t RESERVED3[7];
} stc_pwc_fcg2_bit_t;

typedef struct {
    __IO uint32_t ADC1;
    __IO uint32_t ADC2;
    __IO uint32_t ADC3;
    uint32_t RESERVED0[1];
    __IO uint32_t DAC1;
    __IO uint32_t DAC2;
    uint32_t RESERVED1[2];
    __IO uint32_t CMP12;
    __IO uint32_t CMP3;
    uint32_t RESERVED2[10];
    __IO uint32_t USART1;
    __IO uint32_t USART2;
    __IO uint32_t USART3;
    __IO uint32_t USART4;
    uint32_t RESERVED3[8];
} stc_pwc_fcg3_bit_t;

typedef struct {
    __IO uint32_t PRT0;
    uint32_t RESERVED0[31];
} stc_pwc_fcg0pc_bit_t;

typedef struct {
    uint32_t RESERVED0[12];
    __IO uint32_t WKOVF;
    uint32_t RESERVED1[2];
    __IO uint32_t WKTCE;
} stc_pwc_wktcr_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t PWDN;
} stc_pwc_pwrc0_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t VHRCSD;
    uint32_t RESERVED1[5];
} stc_pwc_pwrc1_bit_t;

typedef struct {
    uint32_t RESERVED0[5];
    __IO uint32_t PD1PW;
    uint32_t RESERVED1[1];
    __IO uint32_t ADBUFE;
} stc_pwc_pwrc4_bit_t;

typedef struct {
    __IO uint32_t EXVCCINEN;
    uint32_t RESERVED0[4];
    __IO uint32_t PVD1EN;
    __IO uint32_t PVD2EN;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr0_bit_t;

typedef struct {
    __IO uint32_t PVD1IRE;
    __IO uint32_t PVD1IRS;
    __IO uint32_t PVD1CMPOE;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2IRE;
    __IO uint32_t PVD2IRS;
    __IO uint32_t PVD2CMPOE;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr1_bit_t;

typedef struct {
    __IO uint32_t PVD1NFDIS;
    uint32_t RESERVED0[3];
    __IO uint32_t PVD2NFDIS;
    uint32_t RESERVED1[3];
} stc_pwc_pvdfcr_bit_t;

typedef struct {
    __IO uint32_t WKE00;
    __IO uint32_t WKE01;
    __IO uint32_t WKE02;
    __IO uint32_t WKE03;
    __IO uint32_t WKE10;
    __IO uint32_t WKE11;
    __IO uint32_t WKE12;
    __IO uint32_t WKE13;
} stc_pwc_pdwke0_bit_t;

