MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334FAUI/mcu.h
typedef struct {
    uint32_t                                 RESERVED0[96];
    stc_mcan_dbtp_bit_t                      DBTP_b;
    stc_mcan_test_bit_t                      TEST_b;
    uint32_t                                 RESERVED1[32];
    stc_mcan_cccr_bit_t                      CCCR_b;
    uint32_t                                 RESERVED2[96];
    stc_mcan_tocc_bit_t                      TOCC_b;
    uint32_t                                 RESERVED3[160];
    stc_mcan_ecr_bit_t                       ECR_b;
    stc_mcan_psr_bit_t                       PSR_b;
    uint32_t                                 RESERVED4[64];
    stc_mcan_ir_bit_t                        IR_b;
    stc_mcan_ie_bit_t                        IE_b;
    stc_mcan_ils_bit_t                       ILS_b;
    stc_mcan_ile_bit_t                       ILE_b;
    uint32_t                                 RESERVED5[256];
    stc_mcan_gfc_bit_t                       GFC_b;
    uint32_t                                 RESERVED6[128];
    stc_mcan_hpms_bit_t                      HPMS_b;
    stc_mcan_ndat1_bit_t                     NDAT1_b;
    stc_mcan_ndat2_bit_t                     NDAT2_b;
    stc_mcan_rxf0c_bit_t                     RXF0C_b;
    stc_mcan_rxf0s_bit_t                     RXF0S_b;
    uint32_t                                 RESERVED7[64];
    stc_mcan_rxf1c_bit_t                     RXF1C_b;
    stc_mcan_rxf1s_bit_t                     RXF1S_b;
    uint32_t                                 RESERVED8[64];
    stc_mcan_txbc_bit_t                      TXBC_b;
    stc_mcan_txfqs_bit_t                     TXFQS_b;
    uint32_t                                 RESERVED9[32];
    stc_mcan_txbrp_bit_t                     TXBRP_b;
    stc_mcan_txbar_bit_t                     TXBAR_b;
    stc_mcan_txbcr_bit_t                     TXBCR_b;
    stc_mcan_txbto_bit_t                     TXBTO_b;
    stc_mcan_txbcf_bit_t                     TXBCF_b;
    stc_mcan_txbtie_bit_t                    TXBTIE_b;
    stc_mcan_txbcie_bit_t                    TXBCIE_b;
    uint32_t                                 RESERVED10[96];
    stc_mcan_txefs_bit_t                     TXEFS_b;
} bCM_MCAN_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_mcanram_cksr_bit_t                   CKSR_b;
    stc_mcanram_eien_bit_t                   EIEN_b;
} bCM_MCANRAM_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[512];
    stc_mpu_sr_bit_t                         SR_b;
    stc_mpu_eclr_bit_t                       ECLR_b;
    stc_mpu_wp_bit_t                         WP_b;
    stc_mpu_ippr_bit_t                       IPPR_b;
    uint32_t                                 RESERVED1[32];
    stc_mpu_msppctl_bit_t                    MSPPCTL_b;
    uint32_t                                 RESERVED2[32];
    stc_mpu_psppctl_bit_t                    PSPPCTL_b;
    stc_mpu_srge_bit_t                       S1RGE_b;
    stc_mpu_srgwp_bit_t                      S1RGWP_b;
    stc_mpu_srgrp_bit_t                      S1RGRP_b;
    stc_mpu_scr_bit_t                        S1CR_b;
} bCM_MPU_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[160];
    stc_peric_tmr_synenr_bit_t               TMR_SYNENR_b;
    uint32_t                                 RESERVED1[32];
    stc_peric_usart1_nfc_bit_t               USART1_NFC_b;
} bCM_PERIC_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[128];
    stc_pla_muxs_bit_t                       MUXS0_b;
    uint32_t                                 RESERVED1[32];
    stc_pla_ctl_bit_t                        CTL0_b;
    stc_pla_muxs_bit_t                       MUXS1_b;
    uint32_t                                 RESERVED2[32];
    stc_pla_ctl_bit_t                        CTL1_b;
    stc_pla_muxs_bit_t                       MUXS2_b;
    uint32_t                                 RESERVED3[32];
    stc_pla_ctl_bit_t                        CTL2_b;
    stc_pla_muxs_bit_t                       MUXS3_b;
    uint32_t                                 RESERVED4[32];
    stc_pla_ctl_bit_t                        CTL3_b;
    stc_pla_muxs_bit_t                       MUXS4_b;
    uint32_t                                 RESERVED5[32];
    stc_pla_ctl_bit_t                        CTL4_b;
    stc_pla_muxs_bit_t                       MUXS5_b;
    uint32_t                                 RESERVED6[32];
    stc_pla_ctl_bit_t                        CTL5_b;
    stc_pla_muxs_bit_t                       MUXS6_b;
    uint32_t                                 RESERVED7[32];
    stc_pla_ctl_bit_t                        CTL6_b;
    stc_pla_muxs_bit_t                       MUXS7_b;
    uint32_t                                 RESERVED8[32];
    stc_pla_ctl_bit_t                        CTL7_b;
    stc_pla_muxs_bit_t                       MUXS8_b;
    uint32_t                                 RESERVED9[32];
    stc_pla_ctl_bit_t                        CTL8_b;
    stc_pla_muxs_bit_t                       MUXS9_b;
    uint32_t                                 RESERVED10[32];
    stc_pla_ctl_bit_t                        CTL9_b;
    stc_pla_muxs_bit_t                       MUXS10_b;
    uint32_t                                 RESERVED11[32];
    stc_pla_ctl_bit_t                        CTL10_b;
    stc_pla_muxs_bit_t                       MUXS11_b;
    uint32_t                                 RESERVED12[32];
    stc_pla_ctl_bit_t                        CTL11_b;
    stc_pla_muxs_bit_t                       MUXS12_b;
    uint32_t                                 RESERVED13[32];
    stc_pla_ctl_bit_t                        CTL12_b;
    stc_pla_muxs_bit_t                       MUXS13_b;
    uint32_t                                 RESERVED14[32];
    stc_pla_ctl_bit_t                        CTL13_b;
    stc_pla_muxs_bit_t                       MUXS14_b;
    uint32_t                                 RESERVED15[32];
    stc_pla_ctl_bit_t                        CTL14_b;
    stc_pla_muxs_bit_t                       MUXS15_b;
    uint32_t                                 RESERVED16[32];
    stc_pla_ctl_bit_t                        CTL15_b;
} bCM_PLA_TypeDef;

